; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))

  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (and (calibrated ?i)))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (and (have_image ?d ?m))))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	satellite3 - satellite
	instrument9 - instrument
	satellite4 - satellite
	instrument10 - instrument
	instrument11 - instrument
	instrument12 - instrument
	image1 - mode
	spectrograph4 - mode
	thermograph3 - mode
	spectrograph2 - mode
	infrared0 - mode
	Star1 - direction
	GroundStation0 - direction
	Star2 - direction
	GroundStation3 - direction
	Phenomenon4 - direction
	Star5 - direction
	Planet6 - direction
	Phenomenon7 - direction
	Phenomenon8 - direction
	Star9 - direction
	Star10 - direction
	Planet11 - direction
	Planet12 - direction
	Star13 - direction
	Planet14 - direction
	Planet15 - direction
	Phenomenon16 - direction
	Phenomenon17 - direction
	Planet18 - direction
	Planet19 - direction
)
(:init
	(supports instrument0 spectrograph2)
	(supports instrument0 image1)
	(calibration_target instrument0 Star1)
	(supports instrument1 spectrograph4)
	(supports instrument1 thermograph3)
	(calibration_target instrument1 Star1)
	(supports instrument2 spectrograph4)
	(supports instrument2 infrared0)
	(calibration_target instrument2 Star2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon4)
	(supports instrument3 spectrograph2)
	(calibration_target instrument3 GroundStation3)
	(supports instrument4 spectrograph4)
	(supports instrument4 thermograph3)
	(supports instrument4 image1)
	(calibration_target instrument4 GroundStation3)
	(supports instrument5 spectrograph2)
	(calibration_target instrument5 Star1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon4)
	(supports instrument6 thermograph3)
	(supports instrument6 image1)
	(supports instrument6 infrared0)
	(calibration_target instrument6 GroundStation0)
	(supports instrument7 infrared0)
	(supports instrument7 spectrograph4)
	(supports instrument7 spectrograph2)
	(calibration_target instrument7 Star1)
	(supports instrument8 image1)
	(supports instrument8 spectrograph4)
	(supports instrument8 infrared0)
	(calibration_target instrument8 Star2)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(on_board instrument8 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet18)
	(supports instrument9 spectrograph4)
	(supports instrument9 image1)
	(calibration_target instrument9 GroundStation3)
	(on_board instrument9 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star10)
	(supports instrument10 spectrograph2)
	(supports instrument10 infrared0)
	(calibration_target instrument10 GroundStation0)
	(supports instrument11 spectrograph2)
	(supports instrument11 thermograph3)
	(supports instrument11 infrared0)
	(calibration_target instrument11 Star2)
	(supports instrument12 infrared0)
	(calibration_target instrument12 GroundStation3)
	(on_board instrument10 satellite4)
	(on_board instrument11 satellite4)
	(on_board instrument12 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Planet15)
)
(:goal (and
	(pointing satellite0 Planet6)
	(pointing satellite1 Star9)
	(pointing satellite2 Star1)
	(pointing satellite3 Star5)
	(have_image Phenomenon4 infrared0)
	(have_image Star5 spectrograph4)
	(have_image Planet6 infrared0)
	(have_image Phenomenon7 spectrograph4)
	(have_image Phenomenon8 thermograph3)
	(have_image Star9 spectrograph2)
	(have_image Star10 thermograph3)
	(have_image Planet11 spectrograph4)
	(have_image Planet12 image1)
	(have_image Star13 image1)
	(have_image Planet14 image1)
	(have_image Planet15 spectrograph2)
	(have_image Phenomenon16 infrared0)
	(have_image Phenomenon17 spectrograph4)
	(have_image Planet19 spectrograph4)
))

)

; plan
1. (switch_on instrument10 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument10)
   goals met: 0 of 19
2. (switch_on instrument4 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument4)
   goals met: 0 of 19
3. (turn_to satellite4 groundstation0 planet15)
   deleted: (pointing satellite4 planet15)
   added: (pointing satellite4 groundstation0)
   goals met: 0 of 19
4. (calibrate satellite4 instrument10 groundstation0)
   added: (calibrated instrument10)
   goals met: 0 of 19
5. (turn_to satellite4 phenomenon16 groundstation0)
   deleted: (pointing satellite4 groundstation0)
   added: (pointing satellite4 phenomenon16)
   goals met: 0 of 19
6. (take_image satellite4 phenomenon16 instrument10 infrared0)
   added: (have_image phenomenon16 infrared0)
   goals met: 1 of 19
7. (turn_to satellite4 phenomenon4 phenomenon16)
   deleted: (pointing satellite4 phenomenon16)
   added: (pointing satellite4 phenomenon4)
   goals met: 1 of 19
8. (take_image satellite4 phenomenon4 instrument10 infrared0)
   added: (have_image phenomenon4 infrared0)
   goals met: 2 of 19
9. (turn_to satellite4 planet15 phenomenon4)
   deleted: (pointing satellite4 phenomenon4)
   added: (pointing satellite4 planet15)
   goals met: 2 of 19
10. (take_image satellite4 planet15 instrument10 spectrograph2)
   added: (have_image planet15 spectrograph2)
   goals met: 3 of 19
11. (turn_to satellite4 planet6 planet15)
   deleted: (pointing satellite4 planet15)
   added: (pointing satellite4 planet6)
   goals met: 3 of 19
12. (take_image satellite4 planet6 instrument10 infrared0)
   added: (have_image planet6 infrared0)
   goals met: 4 of 19
13. (turn_to satellite4 star9 planet6)
   deleted: (pointing satellite4 planet6)
   added: (pointing satellite4 star9)
   goals met: 4 of 19
14. (take_image satellite4 star9 instrument10 spectrograph2)
   added: (have_image star9 spectrograph2)
   goals met: 5 of 19
15. (turn_to satellite3 star5 star10)
   deleted: (pointing satellite3 star10)
   added: (pointing satellite3 star5)
   goals met: 6 of 19
16. (turn_to satellite2 star1 planet18)
   deleted: (pointing satellite2 planet18)
   added: (pointing satellite2 star1)
   goals met: 7 of 19
17. (turn_to satellite1 groundstation3 phenomenon4)
   deleted: (pointing satellite1 phenomenon4)
   added: (pointing satellite1 groundstation3)
   goals met: 7 of 19
18. (calibrate satellite1 instrument4 groundstation3)
   added: (calibrated instrument4)
   goals met: 7 of 19
19. (turn_to satellite1 phenomenon17 groundstation3)
   deleted: (pointing satellite1 groundstation3)
   added: (pointing satellite1 phenomenon17)
   goals met: 7 of 19
20. (take_image satellite1 phenomenon17 instrument4 spectrograph4)
   added: (have_image phenomenon17 spectrograph4)
   goals met: 8 of 19
21. (turn_to satellite1 phenomenon7 phenomenon17)
   deleted: (pointing satellite1 phenomenon17)
   added: (pointing satellite1 phenomenon7)
   goals met: 8 of 19
22. (take_image satellite1 phenomenon7 instrument4 spectrograph4)
   added: (have_image phenomenon7 spectrograph4)
   goals met: 9 of 19
23. (turn_to satellite1 phenomenon8 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 phenomenon8)
   goals met: 9 of 19
24. (take_image satellite1 phenomenon8 instrument4 thermograph3)
   added: (have_image phenomenon8 thermograph3)
   goals met: 10 of 19
25. (turn_to satellite1 planet11 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 planet11)
   goals met: 10 of 19
26. (take_image satellite1 planet11 instrument4 spectrograph4)
   added: (have_image planet11 spectrograph4)
   goals met: 11 of 19
27. (turn_to satellite1 planet12 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 planet12)
   goals met: 11 of 19
28. (take_image satellite1 planet12 instrument4 image1)
   added: (have_image planet12 image1)
   goals met: 12 of 19
29. (turn_to satellite1 planet14 planet12)
   deleted: (pointing satellite1 planet12)
   added: (pointing satellite1 planet14)
   goals met: 12 of 19
30. (take_image satellite1 planet14 instrument4 image1)
   added: (have_image planet14 image1)
   goals met: 13 of 19
31. (turn_to satellite1 planet19 planet14)
   deleted: (pointing satellite1 planet14)
   added: (pointing satellite1 planet19)
   goals met: 13 of 19
32. (take_image satellite1 planet19 instrument4 spectrograph4)
   added: (have_image planet19 spectrograph4)
   goals met: 14 of 19
33. (turn_to satellite1 star10 planet19)
   deleted: (pointing satellite1 planet19)
   added: (pointing satellite1 star10)
   goals met: 14 of 19
34. (take_image satellite1 star10 instrument4 thermograph3)
   added: (have_image star10 thermograph3)
   goals met: 15 of 19
35. (turn_to satellite1 star13 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 star13)
   goals met: 15 of 19
36. (take_image satellite1 star13 instrument4 image1)
   added: (have_image star13 image1)
   goals met: 16 of 19
37. (turn_to satellite1 star5 star13)
   deleted: (pointing satellite1 star13)
   added: (pointing satellite1 star5)
   goals met: 16 of 19
38. (take_image satellite1 star5 instrument4 spectrograph4)
   added: (have_image star5 spectrograph4)
   goals met: 17 of 19
39. (turn_to satellite1 star9 star5)
   deleted: (pointing satellite1 star5)
   added: (pointing satellite1 star9)
   goals met: 18 of 19
40. (turn_to satellite0 planet6 phenomenon4)
   deleted: (pointing satellite0 phenomenon4)
   added: (pointing satellite0 planet6)
   goals met: 19 of 19
